haikevins/secure-delta-ota-bootloader/node-stm32f103/bootloader/src/image_installer.c
#include "image_installer.h"

#include <stdint.h>

#include "application_jump.h"
#include "backup_image.h"
#include "backup_image_storage.h"
#include "backup_progress.h"
#include "crc32.h"
#include "delta_patch.h"
#include "firmware_container.h"
#include "download_checkpoint_storage.h"
#include "external_flash_storage.h"
#include "full_image_validation.h"
#include "install_progress.h"
#include "memory_map.h"
#include "secure_container.h"
#include "metadata_storage.h"
#include "spi_flash.h"
#include "stm32f10x.h"
#include "stm32f10x_flash.h"
#include "update_handoff.h"
#include "update_handoff_storage.h"

#define INSTALL_CRC_BUFFER_SIZE 256UL
#define IMAGE_INSTALLER_ERROR_BASE       0x00080000UL

/*
 * A complete internal Flash page is staged in SRAM before the corresponding
 * application page is erased. The same buffer is also reused while backing up
 * the active image to W25Q.
 */
static uint8_t g_install_page_buffer[INTERNAL_FLASH_PAGE_SIZE];

static uint32_t InstallerError(ImageInstallerStatus_t status)
{
    return IMAGE_INSTALLER_ERROR_BASE | (uint32_t)status;
}

static uint32_t GetPrimask(void)
{
    uint32_t primask;
    __asm volatile ("mrs %0, primask" : "=r" (primask));
    return primask;
}

static void RestorePrimask(uint32_t primask)
{
    __asm volatile ("msr primask, %0" : : "r" (primask) : "memory");
}

static uint32_t GetU32Le(const uint8_t *src)
{
    return (uint32_t)src[0] |
           ((uint32_t)src[1] << 8U) |
           ((uint32_t)src[2] << 16U) |
           ((uint32_t)src[3] << 24U);
}

typedef struct
{
    ExternalFlashPartition_t partition;
    uint32_t update_id;
    uint32_t target_version;
    uint32_t image_size;
    uint32_t image_crc32;
    uint8_t is_delta;
} CandidateSource_t;

#if SECURE_CONTAINER_ALLOW_UNSIGNED_LEGACY != 0
static uint8_t FullRecordMatchesMetadata(
    const UpdateHandoffRecord_t *record,
    const BootMetadata_t *metadata)
{
    return (uint8_t)(
        (record->update_id == metadata->active_update_id) &&
        (record->target_version == metadata->pending_version) &&
        (record->image_size == metadata->expected_size) &&
        (metadata->received_size == metadata->expected_size));
}
#endif

static ImageInstallerStatus_t LoadCandidateSource(
    const BootMetadata_t *metadata,
    CandidateSource_t *source)
{
    uint8_t first_word[4];

    if ((metadata == (const BootMetadata_t *)0) ||
        (source == (CandidateSource_t *)0))
    {
        return IMAGE_INSTALLER_HANDOFF_MISMATCH;
    }

    if (!ExternalFlashStorage_Read(
            EXTERNAL_FLASH_PARTITION_INCOMING,
            0UL,
            first_word,
            sizeof(first_word)))
    {
        return IMAGE_INSTALLER_SOURCE_READ_FAILED;
    }

    if (GetU32Le(first_word) == FW_CONTAINER_MAGIC)
    {
        FirmwareContainerInfo_t info;

        /*
         * Re-authenticate the signed envelope on every recovery boot before
         * trusting target_size/target_crc from external Flash.
         */
        if (SecureContainer_LoadVerifiedInfo(0UL, &info) !=
            SECURE_CONTAINER_OK)
        {
            return IMAGE_INSTALLER_HANDOFF_MISMATCH;
        }

        if ((metadata->state == (uint32_t)UPDATE_ARTIFACT_READY) ||
            (metadata->pending_version != info.header.target_version) ||
            (metadata->active_update_id == 0UL) ||
            (metadata->received_size != info.header.target_image_size) ||
            (metadata->expected_size != info.header.target_image_size))
        {
            return IMAGE_INSTALLER_HANDOFF_MISMATCH;
        }

        if ((info.header.image_type == (uint32_t)FW_IMAGE_DELTA) &&
            (metadata->active_version != info.header.base_version))
        {
            return IMAGE_INSTALLER_HANDOFF_MISMATCH;
        }

        source->partition =
            EXTERNAL_FLASH_PARTITION_RECONSTRUCTED;
        source->update_id = metadata->active_update_id;
        source->target_version = info.header.target_version;
        source->image_size = info.header.target_image_size;
        source->image_crc32 = info.extension.target_image_crc32;
        source->is_delta =
            (uint8_t)(info.header.image_type == (uint32_t)FW_IMAGE_DELTA);
        return IMAGE_INSTALLER_OK;
    }

#if SECURE_CONTAINER_ALLOW_UNSIGNED_LEGACY != 0
    if (GetU32Le(first_word) == DELTA_PATCH_MAGIC)
    {
        uint8_t raw[DELTA_PATCH_HEADER_SIZE];
        DeltaPatchHeader_t header;

        if (!ExternalFlashStorage_Read(
                EXTERNAL_FLASH_PARTITION_INCOMING,
                0UL,
                raw,
                sizeof(raw)))
        {
            return IMAGE_INSTALLER_SOURCE_READ_FAILED;
        }

        if (DeltaPatch_ParseHeader(raw, 0UL, &header) !=
            DELTA_PATCH_HEADER_VALID)
        {
            return IMAGE_INSTALLER_HANDOFF_MISMATCH;
        }

        if ((metadata->state == (uint32_t)UPDATE_ARTIFACT_READY) ||
            (metadata->pending_version != header.target_version) ||
            (metadata->active_version != header.base_version) ||
            (metadata->active_update_id == 0UL) ||
            (metadata->received_size != header.target_image_size) ||
            (metadata->expected_size != header.target_image_size))
        {
            return IMAGE_INSTALLER_HANDOFF_MISMATCH;
        }

        source->partition =
            EXTERNAL_FLASH_PARTITION_RECONSTRUCTED;
        source->update_id = metadata->active_update_id;
        source->target_version = header.target_version;
        source->image_size = header.target_image_size;
        source->image_crc32 = header.target_image_crc32;
        source->is_delta = 1U;
        return IMAGE_INSTALLER_OK;
    }
    else
    {
        UpdateHandoffRecord_t record;
        UpdateHandoffStorageStatus_t handoff_status =
            UpdateHandoffStorage_Load(
                &record,
                (UpdateHandoffSlot_t *)0);

        if (handoff_status != UPDATE_HANDOFF_STORAGE_OK)
        {
            return IMAGE_INSTALLER_HANDOFF_LOAD_FAILED;
        }

        if (FullRecordMatchesMetadata(&record, metadata) == 0U)
        {
            return IMAGE_INSTALLER_HANDOFF_MISMATCH;
        }

        source->partition =
            EXTERNAL_FLASH_PARTITION_INCOMING;
        source->update_id = record.update_id;
        source->target_version = record.target_version;
        source->image_size = record.image_size;
        source->image_crc32 = record.image_crc32;
        source->is_delta = 0U;
        return IMAGE_INSTALLER_OK;
    }
#else
    return IMAGE_INSTALLER_HANDOFF_MISMATCH;
#endif
}

static MetadataStorageStatus_t CommitMetadata(BootMetadata_t *metadata)
{
    BootMetadata_t committed;
    const MetadataStorageStatus_t status =
        MetadataStorage_Commit(metadata, &committed, (BootMetadataSlot_t *)0);

    if (status == METADATA_STORAGE_OK)
    {
        *metadata = committed;
    }

