haikevins/secure-delta-ota-bootloader/node-stm32f103/bootloader/src/image_installer.c
    return status;
}

static void CopyResult(const BootMetadata_t *metadata,
                       BootMetadata_t *result_metadata)
{
    if (result_metadata != (BootMetadata_t *)0)
    {
        *result_metadata = *metadata;
    }
}


#define HIL_FAULT_BACKUP_MARKER  0xF0160002UL
#define HIL_FAULT_INSTALL_MARKER 0xF0160003UL
#define HIL_FAULT_ROLLBACK_TAG   0xF1000000UL
#define HIL_FAULT_ROLLBACK_MASK  0x00FFFFFFUL

#if defined(HIL_FAULT_BACKUP_RESET_OFFSET) || \
    defined(HIL_FAULT_INSTALL_OFFSET) || \
    defined(HIL_FAULT_ROLLBACK_RESET_OFFSET)
static ImageInstallerStatus_t FaultCommitMarkerAndReset(
    BootMetadata_t *metadata,
    uint32_t marker)
{
    metadata->last_error = marker;

    if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
    {
        return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
    }

    NVIC_SystemReset();
    for (;;)
    {
        __NOP();
    }
}
#endif

static ImageInstallerStatus_t RevertToActiveImage(
    BootMetadata_t *metadata,
    ImageInstallerStatus_t reason,
    BootMetadata_t *result_metadata)
{
    metadata->state = (uint32_t)UPDATE_IDLE;
    metadata->pending_version = 0UL;
    metadata->active_update_id = 0UL;
    metadata->received_size = 0UL;
    metadata->expected_size = 0UL;
    metadata->copy_offset = 0UL;
    metadata->boot_attempts = 0UL;
    metadata->last_error = InstallerError(reason);

    /*
     * The active internal image is still untouched in ARTIFACT_READY and
     * BACKING_UP. Discarding the persistent download checkpoint prevents the
     * application from resurrecting a rejected candidate on the next boot.
     */
    (void)DownloadCheckpointStorage_Clear();

    if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
    {
        return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
    }

    CopyResult(metadata, result_metadata);
    return IMAGE_INSTALLER_SOURCE_REJECTED;
}

static void BestEffortMarkFailed(BootMetadata_t *metadata,
                                 ImageInstallerStatus_t reason)
{
    metadata->state = (uint32_t)UPDATE_FAILED;
    metadata->last_error = InstallerError(reason);
    (void)CommitMetadata(metadata);
}

static uint32_t CalculateInternalCrc(uint32_t length)
{
    uint8_t buffer[INSTALL_CRC_BUFFER_SIZE];
    uint32_t offset = 0UL;
    uint32_t running = CRC32_IEEE_INITIAL_VALUE;

    while (offset < length)
    {
        uint32_t chunk = length - offset;
        uint32_t i;
        volatile const uint8_t *source;

        if (chunk > sizeof(buffer))
        {
            chunk = sizeof(buffer);
        }

        source = (volatile const uint8_t *)(APPLICATION_START_ADDRESS + offset);
        for (i = 0UL; i < chunk; ++i)
        {
            buffer[i] = source[i];
        }

        running = Crc32_Update(running, buffer, chunk);
        offset += chunk;
    }

    return running ^ CRC32_IEEE_FINAL_XOR;
}

static ImageInstallerStatus_t CalculateExternalCrc(
    ExternalFlashPartition_t partition,
    uint32_t length,
    uint32_t *crc_out)
{
    uint8_t buffer[INSTALL_CRC_BUFFER_SIZE];
    uint32_t offset = 0UL;
    uint32_t running = CRC32_IEEE_INITIAL_VALUE;

    if (crc_out == (uint32_t *)0)
    {
        return IMAGE_INSTALLER_SOURCE_READ_FAILED;
    }

    while (offset < length)
    {
        uint32_t chunk = length - offset;

        if (chunk > sizeof(buffer))
        {
            chunk = sizeof(buffer);
        }

        if (!ExternalFlashStorage_Read(partition,
                                       offset, buffer, chunk))
        {
            return IMAGE_INSTALLER_SOURCE_READ_FAILED;
        }

        running = Crc32_Update(running, buffer, chunk);
        offset += chunk;
    }

    *crc_out = running ^ CRC32_IEEE_FINAL_XOR;
    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t CalculateBackupCrc(uint32_t *crc_out)
{
    uint8_t buffer[INSTALL_CRC_BUFFER_SIZE];
    uint32_t offset = 0UL;
    uint32_t running = CRC32_IEEE_INITIAL_VALUE;

    if (crc_out == (uint32_t *)0)
    {
        return IMAGE_INSTALLER_BACKUP_VERIFY_FAILED;
    }

    while (offset < APPLICATION_MAX_SIZE)
    {
        uint32_t chunk = APPLICATION_MAX_SIZE - offset;

        if (chunk > sizeof(buffer))
        {
            chunk = sizeof(buffer);
        }

        if (!BackupImageStorage_Read(offset, buffer, chunk))
        {
            return IMAGE_INSTALLER_BACKUP_VERIFY_FAILED;
        }

        running = Crc32_Update(running, buffer, chunk);
        offset += chunk;
    }

    *crc_out = running ^ CRC32_IEEE_FINAL_XOR;
    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t ValidateExternalSource(
    const CandidateSource_t *source)
{
    uint8_t vector[8];
    uint32_t crc;
    ImageInstallerStatus_t crc_status;

    if ((source == (const CandidateSource_t *)0) ||
        !ExternalFlashStorage_Read(
            source->partition,
            0UL,
            vector,
            sizeof(vector)))
    {
        return IMAGE_INSTALLER_SOURCE_READ_FAILED;
    }

    if (FullImage_ValidateVector(
            source->image_size,
            GetU32Le(&vector[0]),
            GetU32Le(&vector[4])) != FULL_IMAGE_VALID)
    {
        return IMAGE_INSTALLER_SOURCE_VECTOR_INVALID;
    }

    crc_status = CalculateExternalCrc(
        source->partition,
        source->image_size,
        &crc);
    if (crc_status != IMAGE_INSTALLER_OK)
    {
        return crc_status;
    }

    if (crc != source->image_crc32)
    {
        return IMAGE_INSTALLER_SOURCE_CRC_MISMATCH;
    }

    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t ValidateBackupImage(
    BackupImageRecord_t *record)
{
    uint32_t crc = 0UL;
    ImageInstallerStatus_t status;

    if (BackupImageStorage_LoadHeader(record) != BACKUP_IMAGE_STORAGE_OK)
    {
        return IMAGE_INSTALLER_ROLLBACK_SOURCE_INVALID;
    }

    status = CalculateBackupCrc(&crc);
    if (status != IMAGE_INSTALLER_OK)
    {
        return status;
    }

    if (crc != record->image_crc32)
    {
        return IMAGE_INSTALLER_BACKUP_CRC_MISMATCH;
    }

    return IMAGE_INSTALLER_OK;
}

