haikevins/secure-delta-ota-bootloader/node-stm32f103/bootloader/src/image_installer.c
static ImageInstallerStatus_t LoadCandidatePage(
    const CandidateSource_t *source,
    uint32_t page_offset,
    uint32_t *page_length)
{
    const uint32_t length =
        InstallProgress_PageLength(
            source->image_size,
            page_offset);

    if ((length == 0UL) ||
        (page_length == (uint32_t *)0))
    {
        return IMAGE_INSTALLER_PROGRESS_INVALID;
    }

    if (!ExternalFlashStorage_Read(
            source->partition,
            page_offset,
            g_install_page_buffer,
            length))
    {
        return IMAGE_INSTALLER_SOURCE_READ_FAILED;
    }

    *page_length = length;
    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t LoadBackupPage(uint32_t page_offset,
                                             uint32_t *page_length)
{
    const uint32_t length =
        InstallProgress_PageLength(APPLICATION_MAX_SIZE, page_offset);

    if ((length == 0UL) || (page_length == (uint32_t *)0))
    {
        return IMAGE_INSTALLER_PROGRESS_INVALID;
    }

    if (!BackupImageStorage_Read(page_offset,
                                 g_install_page_buffer,
                                 length))
    {
        return IMAGE_INSTALLER_ROLLBACK_READ_FAILED;
    }

    *page_length = length;
    return IMAGE_INSTALLER_OK;
}

#if defined(INSTALL_FAULT_INJECT_OFFSET)
static uint8_t ShouldInjectReset(const BootMetadata_t *metadata,
                                 uint32_t page_offset,
                                 uint32_t page_length,
                                 uint32_t bytes_programmed)
{
    const uint32_t inject_offset = (uint32_t)INSTALL_FAULT_INJECT_OFFSET;
    const uint32_t page_end = page_offset + page_length;

    return (uint8_t)(
        (metadata != (const BootMetadata_t *)0) &&
        (metadata->last_error != IMAGE_INSTALLER_FAULT_MARKER) &&
        (inject_offset > page_offset) &&
        (inject_offset < page_end) &&
        ((page_offset + bytes_programmed) >= inject_offset));
}

static ImageInstallerStatus_t InjectOneShotReset(BootMetadata_t *metadata)
{
    /*
     * copy_offset intentionally remains at the previous verified page.
     * The current page is only partially programmed. After reset the normal
     * path re-erases this page before programming it again.
     */
    metadata->last_error = IMAGE_INSTALLER_FAULT_MARKER;

    if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
    {
        return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
    }

    NVIC_SystemReset();
    for (;;)
    {
        __NOP();
    }
}
#endif


#if defined(HIL_FAULT_INSTALL_OFFSET)
static uint8_t ShouldInjectInstallReset(
    const BootMetadata_t *metadata,
    uint32_t page_offset,
    uint32_t page_length,
    uint32_t bytes_programmed)
{
    const uint32_t inject_offset = (uint32_t)HIL_FAULT_INSTALL_OFFSET;
    const uint32_t page_end = page_offset + page_length;

    return (uint8_t)(
        (metadata != (const BootMetadata_t *)0) &&
        (metadata->last_error != HIL_FAULT_INSTALL_MARKER) &&
        (inject_offset > page_offset) &&
        (inject_offset < page_end) &&
        ((page_offset + bytes_programmed) >= inject_offset));
}
#endif

static ImageInstallerStatus_t ProgramBufferedApplicationPage(
    uint32_t page_offset,
    uint32_t page_length,
    BootMetadata_t *metadata,
    uint8_t allow_install_fault)
{
    uint32_t i;
    uint32_t primask;
    FLASH_Status flash_status;
    volatile const uint8_t *installed;

    primask = GetPrimask();
    __disable_irq();

    FLASH_Unlock();
    FLASH_ClearFlag(FLASH_FLAG_EOP | FLASH_FLAG_PGERR |
                    FLASH_FLAG_WRPRTERR);

    flash_status = FLASH_ErasePage(APPLICATION_START_ADDRESS + page_offset);
    if (flash_status != FLASH_COMPLETE)
    {
        FLASH_Lock();
        RestorePrimask(primask);
        return IMAGE_INSTALLER_FLASH_ERASE_FAILED;
    }

    for (i = 0UL; i < page_length; i += 2UL)
    {
        const uint8_t high =
            ((i + 1UL) < page_length) ? g_install_page_buffer[i + 1UL] : 0xFFU;
        const uint16_t halfword =
            (uint16_t)((uint16_t)g_install_page_buffer[i] |
                       ((uint16_t)high << 8U));

        flash_status = FLASH_ProgramHalfWord(
            APPLICATION_START_ADDRESS + page_offset + i,
            halfword);

        if (flash_status != FLASH_COMPLETE)
        {
            FLASH_Lock();
            RestorePrimask(primask);
            return IMAGE_INSTALLER_FLASH_PROGRAM_FAILED;
        }

#if defined(INSTALL_FAULT_INJECT_OFFSET)
        if ((allow_install_fault != 0U) &&
            (ShouldInjectReset(metadata, page_offset, page_length,
                               i + 2UL) != 0U))
        {
            FLASH_Lock();
            RestorePrimask(primask);
            return InjectOneShotReset(metadata);
        }
#else
        (void)allow_install_fault;
#endif

#if defined(HIL_FAULT_INSTALL_OFFSET)
        if ((allow_install_fault != 0U) &&
            (ShouldInjectInstallReset(
                metadata,
                page_offset,
                page_length,
                i + 2UL) != 0U))
        {
            FLASH_Lock();
            RestorePrimask(primask);
            return FaultCommitMarkerAndReset(
                metadata,
                HIL_FAULT_INSTALL_MARKER);
        }
#else
        (void)metadata;
#endif
    }

    FLASH_Lock();
    RestorePrimask(primask);

    installed = (volatile const uint8_t *)(APPLICATION_START_ADDRESS +
                                           page_offset);
    for (i = 0UL; i < page_length; ++i)
    {
        if (installed[i] != g_install_page_buffer[i])
        {
            return IMAGE_INSTALLER_PAGE_VERIFY_FAILED;
        }
    }

    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t ProgramAndVerifyCandidatePage(
    const CandidateSource_t *source,
    uint32_t page_offset,
    BootMetadata_t *metadata)
{
    uint32_t page_length = 0UL;
    ImageInstallerStatus_t status =
        LoadCandidatePage(
            source,
            page_offset,
            &page_length);

