haikevins/secure-delta-ota-bootloader/node-stm32f103/bootloader/src/image_installer.c
    if (status != IMAGE_INSTALLER_OK)
    {
        return status;
    }

    return ProgramBufferedApplicationPage(
        page_offset,
        page_length,
        metadata,
        1U);
}

static ImageInstallerStatus_t ProgramAndVerifyBackupPage(
    uint32_t page_offset,
    BootMetadata_t *metadata)
{
    uint32_t page_length = 0UL;
    ImageInstallerStatus_t status =
        LoadBackupPage(page_offset, &page_length);

    if (status != IMAGE_INSTALLER_OK)
    {
        return status;
    }

    return ProgramBufferedApplicationPage(page_offset,
                                          page_length,
                                          metadata,
                                          0U);
}

static ImageInstallerStatus_t BeginBackup(BootMetadata_t *metadata)
{
    if (BackupImageStorage_InvalidateHeader() != BACKUP_IMAGE_STORAGE_OK)
    {
        return IMAGE_INSTALLER_BACKUP_HEADER_FAILED;
    }

    metadata->state = (uint32_t)UPDATE_BACKING_UP;
    metadata->copy_offset = 0UL;
    metadata->boot_attempts = 0UL;
    metadata->last_error = 0UL;

    if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
    {
        return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
    }

    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t CopyActiveImageToBackupChunk(
    uint32_t chunk_offset,
    uint32_t chunk_length)
{
    uint32_t copied = 0UL;

    if (!BackupImageStorage_EraseSector(chunk_offset))
    {
        return IMAGE_INSTALLER_BACKUP_ERASE_FAILED;
    }

    while (copied < chunk_length)
    {
        uint32_t length = chunk_length - copied;
        uint32_t i;
        volatile const uint8_t *source;

        if (length > sizeof(g_install_page_buffer))
        {
            length = sizeof(g_install_page_buffer);
        }

        source = (volatile const uint8_t *)(APPLICATION_START_ADDRESS +
                                            chunk_offset + copied);
        for (i = 0UL; i < length; ++i)
        {
            g_install_page_buffer[i] = source[i];
        }

        if (!BackupImageStorage_Write(chunk_offset + copied,
                                      g_install_page_buffer,
                                      length))
        {
            return IMAGE_INSTALLER_BACKUP_WRITE_FAILED;
        }

        if (!BackupImageStorage_Verify(chunk_offset + copied,
                                       g_install_page_buffer,
                                       length))
        {
            return IMAGE_INSTALLER_BACKUP_VERIFY_FAILED;
        }

        copied += length;
    }

    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t ResumeBackup(BootMetadata_t *metadata)
{
    ImageInstallerStatus_t status;
    uint32_t internal_crc;
    uint32_t backup_crc = 0UL;
    BackupImageRecord_t requested;
    BackupImageRecord_t committed;

    if (BackupProgress_Validate(metadata->copy_offset) !=
        BACKUP_PROGRESS_VALID)
    {
        return IMAGE_INSTALLER_BACKUP_PROGRESS_INVALID;
    }

    while (metadata->copy_offset < APPLICATION_MAX_SIZE)
    {
        const uint32_t chunk_offset = metadata->copy_offset;
        const uint32_t chunk_length =
            BackupProgress_ChunkLength(chunk_offset);
        const uint32_t next_offset =
            BackupProgress_NextCheckpoint(chunk_offset);

        status = CopyActiveImageToBackupChunk(chunk_offset, chunk_length);
        if (status != IMAGE_INSTALLER_OK)
        {
            return status;
        }

        /*
         * A power cut during a 4 KiB W25Q sector copy leaves copy_offset at
         * the previous sector boundary. Recovery re-erases and rewrites that
         * entire sector.
         */
        metadata->copy_offset = next_offset;
        metadata->last_error = 0UL;

        if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
        {
            return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
        }

#if defined(HIL_FAULT_BACKUP_RESET_OFFSET)
        /*
         * deterministic HIL: reset after a verified 4 KiB backup checkpoint.
         * The exact-offset predicate makes the injection one-shot even though
         * normal recovery clears last_error on the next committed chunk.
         */
        if ((metadata->copy_offset ==
             (uint32_t)HIL_FAULT_BACKUP_RESET_OFFSET) &&
            (metadata->last_error != HIL_FAULT_BACKUP_MARKER))
        {
            return FaultCommitMarkerAndReset(
                metadata,
                HIL_FAULT_BACKUP_MARKER);
        }
#endif
    }

    internal_crc = CalculateInternalCrc(APPLICATION_MAX_SIZE);
    status = CalculateBackupCrc(&backup_crc);
    if (status != IMAGE_INSTALLER_OK)
    {
        return status;
    }
    if (internal_crc != backup_crc)
    {
        return IMAGE_INSTALLER_BACKUP_CRC_MISMATCH;
    }

    BackupImage_Init(&requested, metadata->active_version, backup_crc);
    if (BackupImageStorage_CommitHeader(&requested, &committed) !=
        BACKUP_IMAGE_STORAGE_OK)
    {
        return IMAGE_INSTALLER_BACKUP_HEADER_FAILED;
    }

    metadata->state = (uint32_t)UPDATE_INSTALLING;
    metadata->copy_offset = 0UL;
    metadata->last_error = 0UL;

    if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
    {
        return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
    }

    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t ResumePageCheckpointedCopy(
    const CandidateSource_t *source,
    BootMetadata_t *metadata)
{
    ImageInstallerStatus_t status;

    if (InstallProgress_Validate(
            source->image_size,
            metadata->copy_offset) != INSTALL_PROGRESS_VALID)
    {
        return IMAGE_INSTALLER_PROGRESS_INVALID;
    }

    while (metadata->copy_offset < source->image_size)
    {
        const uint32_t page_offset = metadata->copy_offset;
        const uint32_t next_offset =
            InstallProgress_NextCheckpoint(
                source->image_size,
                page_offset);

        status = ProgramAndVerifyCandidatePage(
            source,
            page_offset,
            metadata);
        if (status != IMAGE_INSTALLER_OK)
        {
            return status;
        }

        metadata->copy_offset = next_offset;
        metadata->last_error = 0UL;

        if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
        {
            return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
        }
    }

    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t VerifyInstalledApplication(
    const CandidateSource_t *source)
{
    volatile const uint32_t *vector =
        (volatile const uint32_t *)APPLICATION_START_ADDRESS;
    ApplicationVector_t application_vector;

    if (CalculateInternalCrc(source->image_size) !=
        source->image_crc32)
    {
        return IMAGE_INSTALLER_VERIFY_CRC_FAILED;
    }

