haikevins/secure-delta-ota-bootloader/node-stm32f103/bootloader/src/image_installer.c
    if (FullImage_ValidateVector(
            source->image_size,
            vector[0],
            vector[1]) != FULL_IMAGE_VALID)
    {
        return IMAGE_INSTALLER_VERIFY_VECTOR_FAILED;
    }

    if (ApplicationJump_Validate(
            APPLICATION_START_ADDRESS,
            &application_vector) != APPLICATION_VALIDATION_OK)
    {
        return IMAGE_INSTALLER_VERIFY_VECTOR_FAILED;
    }

    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t TransitionToVerify(
    BootMetadata_t *metadata,
    uint32_t image_size)
{
    metadata->state = (uint32_t)UPDATE_VERIFYING_INSTALL;
    metadata->copy_offset = image_size;
    metadata->last_error = 0UL;

    if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
    {
        return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
    }

    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t BeginInstall(BootMetadata_t *metadata)
{
    metadata->state = (uint32_t)UPDATE_INSTALLING;
    metadata->copy_offset = 0UL;
    metadata->last_error = 0UL;

    if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
    {
        return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
    }
    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t TransitionToTrialBoot(
    BootMetadata_t *metadata,
    BootMetadata_t *result_metadata)
{
    /*
     * The incoming candidate is no longer required for recovery after internal
     * verify: rollback uses the separate validated backup. Clear the power-loss recovery
     * download checkpoint before publishing TRIAL_BOOT. A reset before the
     * metadata commit simply re-enters VERIFYING_INSTALL and retries.
     */
    if (DownloadCheckpointStorage_Clear() !=
        DOWNLOAD_CHECKPOINT_STORAGE_OK)
    {
        return IMAGE_INSTALLER_CHECKPOINT_CLEAR_FAILED;
    }

    metadata->state = (uint32_t)UPDATE_TRIAL_BOOT;
    metadata->copy_offset = 0UL;
    metadata->boot_attempts = 0UL;
    metadata->last_error = 0UL;

    if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
    {
        return IMAGE_INSTALLER_TRIAL_TRANSITION_FAILED;
    }

    CopyResult(metadata, result_metadata);
    return IMAGE_INSTALLER_OK;
}

static uint32_t RollbackDiagnostic(const BootMetadata_t *metadata)
{
    if (metadata->state == (uint32_t)UPDATE_ROLLBACK)
    {
#if defined(HIL_FAULT_ROLLBACK_RESET_OFFSET)
        /*
         * A fault-injection HIL fault witness keeps the original 24-bit rollback reason
         * in the low bits so the final production diagnostic is restored.
         */
        if ((metadata->last_error & 0xFF000000UL) ==
            HIL_FAULT_ROLLBACK_TAG)
        {
            return metadata->last_error &
                   HIL_FAULT_ROLLBACK_MASK;
        }
#endif
        return metadata->last_error;
    }

    if (metadata->boot_attempts >= BOOT_METADATA_MAX_BOOT_ATTEMPTS)
    {
        return IMAGE_INSTALLER_ROLLBACK_TRIAL_LIMIT_BASE |
               (metadata->boot_attempts & 0xFFUL);
    }

    if (metadata->state == (uint32_t)UPDATE_TRIAL_BOOT)
    {
        return IMAGE_INSTALLER_ROLLBACK_INVALID_TRIAL;
    }

    return IMAGE_INSTALLER_ROLLBACK_INSTALL_BASE;
}

static ImageInstallerStatus_t BeginRollback(
    BootMetadata_t *metadata,
    uint32_t diagnostic)
{
    metadata->state = (uint32_t)UPDATE_ROLLBACK;
    metadata->copy_offset = 0UL;
    metadata->last_error = diagnostic;

    if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
    {
        return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
    }
    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t ResumeRollbackCopy(BootMetadata_t *metadata)
{
    ImageInstallerStatus_t status;

    if (InstallProgress_Validate(APPLICATION_MAX_SIZE,
                                 metadata->copy_offset) !=
        INSTALL_PROGRESS_VALID)
    {
        return IMAGE_INSTALLER_PROGRESS_INVALID;
    }

    while (metadata->copy_offset < APPLICATION_MAX_SIZE)
    {
        const uint32_t page_offset = metadata->copy_offset;
        const uint32_t next_offset =
            InstallProgress_NextCheckpoint(APPLICATION_MAX_SIZE,
                                           page_offset);

        status = ProgramAndVerifyBackupPage(page_offset, metadata);
        if (status != IMAGE_INSTALLER_OK)
        {
            return status;
        }

        metadata->copy_offset = next_offset;
        /* Preserve rollback diagnostic in last_error across every checkpoint. */

        if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
        {
            return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
        }


#if defined(HIL_FAULT_ROLLBACK_RESET_OFFSET)
        /*
         * deterministic HIL: reset after a verified rollback page checkpoint.
         * Encode the original rollback reason into the witness marker so it
         * survives the reset and is restored by RollbackDiagnostic().
         */
        if ((metadata->copy_offset ==
             (uint32_t)HIL_FAULT_ROLLBACK_RESET_OFFSET) &&
            ((metadata->last_error & 0xFF000000UL) !=
             HIL_FAULT_ROLLBACK_TAG))
        {
            const uint32_t witness =
                HIL_FAULT_ROLLBACK_TAG |
                (metadata->last_error &
                 HIL_FAULT_ROLLBACK_MASK);

            return FaultCommitMarkerAndReset(metadata, witness);
        }
#endif
    }

    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t VerifyRolledBackApplication(
    const BackupImageRecord_t *backup)
{
    volatile const uint32_t *vector =
        (volatile const uint32_t *)APPLICATION_START_ADDRESS;
    ApplicationVector_t application_vector;

    if (CalculateInternalCrc(APPLICATION_MAX_SIZE) != backup->image_crc32)
    {
        return IMAGE_INSTALLER_ROLLBACK_VERIFY_FAILED;
    }

    if (FullImage_ValidateVector(APPLICATION_MAX_SIZE,
                                 vector[0], vector[1]) != FULL_IMAGE_VALID)
    {
        return IMAGE_INSTALLER_ROLLBACK_VERIFY_FAILED;
    }

    if (ApplicationJump_Validate(APPLICATION_START_ADDRESS,
                                 &application_vector) !=
        APPLICATION_VALIDATION_OK)
    {
        return IMAGE_INSTALLER_ROLLBACK_VERIFY_FAILED;
    }

    return IMAGE_INSTALLER_OK;
}

