haikevins/secure-delta-ota-bootloader/node-stm32f103/bootloader/src/image_installer.c
static ImageInstallerStatus_t FinalizeRollback(
    BootMetadata_t *metadata,
    const BackupImageRecord_t *backup,
    uint32_t diagnostic,
    BootMetadata_t *result_metadata)
{
    (void)DownloadCheckpointStorage_Clear();

    metadata->state = (uint32_t)UPDATE_IDLE;
    metadata->active_version = backup->active_version;
    metadata->pending_version = 0UL;
    metadata->active_update_id = 0UL;
    metadata->received_size = 0UL;
    metadata->expected_size = 0UL;
    metadata->copy_offset = 0UL;
    metadata->boot_attempts = 0UL;
    /*
     * Unlike a successful confirmation, rollback retains a compact diagnostic
     * so hardware tests and field logs can prove why the previous candidate
     * was rejected. IDLE permits a non-zero last_error.
     */
    metadata->last_error = diagnostic;

    if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
    {
        return IMAGE_INSTALLER_FINALIZE_FAILED;
    }

    CopyResult(metadata, result_metadata);
    return IMAGE_INSTALLER_OK;
}

ImageInstallerStatus_t ImageInstaller_ProcessRollback(
    const BootMetadata_t *metadata,
    BootMetadata_t *result_metadata)
{
    BootMetadata_t working;
    BackupImageRecord_t backup;
    ImageInstallerStatus_t status;
    uint32_t diagnostic;

    if (metadata == (const BootMetadata_t *)0)
    {
        return IMAGE_INSTALLER_ROLLBACK_SOURCE_INVALID;
    }

    working = *metadata;

    if (!ExternalFlashStorage_Init())
    {
        return IMAGE_INSTALLER_EXTERNAL_FLASH_INIT_FAILED;
    }

    status = ValidateBackupImage(&backup);
    if (status != IMAGE_INSTALLER_OK)
    {
        BestEffortMarkFailed(&working, IMAGE_INSTALLER_ROLLBACK_SOURCE_INVALID);
        return IMAGE_INSTALLER_ROLLBACK_SOURCE_INVALID;
    }

    diagnostic = RollbackDiagnostic(&working);

    if (working.state != (uint32_t)UPDATE_ROLLBACK)
    {
        status = BeginRollback(&working, diagnostic);
        if (status != IMAGE_INSTALLER_OK)
        {
            return status;
        }
    }
    else if (InstallProgress_Validate(APPLICATION_MAX_SIZE,
                                      working.copy_offset) !=
             INSTALL_PROGRESS_VALID)
    {
        BestEffortMarkFailed(&working, IMAGE_INSTALLER_PROGRESS_INVALID);
        return IMAGE_INSTALLER_PROGRESS_INVALID;
    }

    status = ResumeRollbackCopy(&working);
    if (status != IMAGE_INSTALLER_OK)
    {
        BestEffortMarkFailed(&working, status);
        return status;
    }

    status = VerifyRolledBackApplication(&backup);
    if (status != IMAGE_INSTALLER_OK)
    {
        BestEffortMarkFailed(&working, status);
        return status;
    }

    return FinalizeRollback(&working, &backup, diagnostic, result_metadata);
}

static ImageInstallerStatus_t RollbackAfterInstallFailure(
    BootMetadata_t *metadata,
    ImageInstallerStatus_t reason,
    BootMetadata_t *result_metadata)
{
    metadata->last_error =
        IMAGE_INSTALLER_ROLLBACK_INSTALL_BASE |
        ((uint32_t)reason & 0xFFUL);

    if (BeginRollback(metadata, metadata->last_error) != IMAGE_INSTALLER_OK)
    {
        return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
    }

    return ImageInstaller_ProcessRollback(metadata, result_metadata);
}

ImageInstallerStatus_t ImageInstaller_ProcessBasicFull(
    const BootMetadata_t *metadata,
    BootMetadata_t *result_metadata)
{
    BootMetadata_t working;
    CandidateSource_t source;
    BackupImageRecord_t backup;
    ImageInstallerStatus_t status;
    const uint8_t internal_may_be_modified =
        (uint8_t)((metadata != (const BootMetadata_t *)0) &&
                  ((metadata->state == (uint32_t)UPDATE_INSTALLING) ||
                   (metadata->state == (uint32_t)UPDATE_VERIFYING_INSTALL)));

    if (metadata == (const BootMetadata_t *)0)
    {
        return IMAGE_INSTALLER_HANDOFF_MISMATCH;
    }

    working = *metadata;

    if (!ExternalFlashStorage_Init())
    {
        return IMAGE_INSTALLER_EXTERNAL_FLASH_INIT_FAILED;
    }

    status = LoadCandidateSource(&working, &source);
    if (status != IMAGE_INSTALLER_OK)
    {
        if (internal_may_be_modified == 0U)
        {
            return RevertToActiveImage(
                &working,
                status,
                result_metadata);
        }

        return RollbackAfterInstallFailure(
            &working,
            status,
            result_metadata);
    }

    /*
     * Candidate source is revalidated on every recovery boot. Full updates
     * read from Incoming Artifact; streaming delta reconstruction deltas read the already verified
     * Reconstructed Image. The active application is not erased before the
     * backup reaches INSTALLING.
     */
    status = ValidateExternalSource(&source);
    if (status != IMAGE_INSTALLER_OK)
    {
        if (internal_may_be_modified == 0U)
        {
            return RevertToActiveImage(
                &working,
                status,
                result_metadata);
        }

        return RollbackAfterInstallFailure(
            &working,
            status,
            result_metadata);
    }

    if ((working.state == (uint32_t)UPDATE_ARTIFACT_READY) ||
        (working.state == (uint32_t)UPDATE_IMAGE_READY))
    {
        status = BeginBackup(&working);
        if (status != IMAGE_INSTALLER_OK)
        {
            BestEffortMarkFailed(&working, status);
            return status;
        }
    }

    if (working.state == (uint32_t)UPDATE_BACKING_UP)
    {
        status = ResumeBackup(&working);
        if (status != IMAGE_INSTALLER_OK)
        {
            /*
             * Internal app remains untouched until backup has completely
             * verified and the metadata state reaches INSTALLING.
             */
            return RevertToActiveImage(
                &working,
                status,
                result_metadata);
        }
    }

    status = ValidateBackupImage(&backup);
    if (status != IMAGE_INSTALLER_OK)
    {
        BestEffortMarkFailed(&working, status);
        return status;
    }

    if (working.state == (uint32_t)UPDATE_VERIFYING_INSTALL)
    {
        status = VerifyInstalledApplication(&source);
        if (status == IMAGE_INSTALLER_OK)
        {
            return TransitionToTrialBoot(
                &working,
                result_metadata);
        }

        status = BeginInstall(&working);
        if (status != IMAGE_INSTALLER_OK)
        {
            return status;
        }
    }
    else if (working.state == (uint32_t)UPDATE_INSTALLING)
    {
        if (InstallProgress_Validate(
                source.image_size,
                working.copy_offset) != INSTALL_PROGRESS_VALID)
        {
            return RollbackAfterInstallFailure(
                &working,
                IMAGE_INSTALLER_PROGRESS_INVALID,
                result_metadata);
        }
    }
    else
    {
        return RollbackAfterInstallFailure(
            &working,
            IMAGE_INSTALLER_HANDOFF_MISMATCH,
            result_metadata);
    }

    status = ResumePageCheckpointedCopy(
        &source,
        &working);
    if (status != IMAGE_INSTALLER_OK)
    {
        if (status == IMAGE_INSTALLER_METADATA_COMMIT_FAILED)
        {
            return status;
        }

        return RollbackAfterInstallFailure(
            &working,
            status,
            result_metadata);
    }

    status = TransitionToVerify(
        &working,
        source.image_size);
    if (status != IMAGE_INSTALLER_OK)
    {
        return status;
    }

    status = VerifyInstalledApplication(&source);
    if (status != IMAGE_INSTALLER_OK)
    {
        return RollbackAfterInstallFailure(
            &working,
            status,
            result_metadata);
    }

    return TransitionToTrialBoot(
        &working,
        result_metadata);
}

